load.yml
config:
  target: "http://ktxwaitingroom.nextcloudlab.com"
  phases:
    # Phase 1: 워밍업 (2,000명) - 2분간 점진적 증가
    - duration: 120
      arrivalRate: 17
      name: "워밍업 단계"
    # Phase 2: 피크 러시 (6,000명) - 5분간 고강도 부하
    - duration: 300
      arrivalRate: 20
      name: "피크 러시 단계"
    # Phase 3: 쿨다운 (2,000명) - 2분간 점진적 감소
    - duration: 120
      arrivalRate: 17
      name: "쿨다운 단계"

scenarios:
  - name: "KTX 예매 시나리오"
    weight: 100
    flow:
      # 사용자 접속 대기
      - think: 2

      # KTX 예매 요청
      - post:
          url: "/api/book-ktx"
          json:
            route: "서울 → 부산"
            date: "2025-02-09"
            passengers: 1
          capture:
            - json: "$.userId"
              as: "userId"
            - json: "$.sessionId"
              as: "sessionId"
            - json: "$.status"
              as: "status"
          expect:
            - statusCode: [200, 201]

      # 대기열 상태 확인 (3회 반복)
      - get:
          url: "/api/queue-status"
          qs:
            userId: "{{ userId }}"
          expect:
            - statusCode: 200

      - think: 5

      - get:
          url: "/api/queue-status"
          qs:
            userId: "{{ userId }}"
          expect:
            - statusCode: 200

      - think: 5

      - get:
          url: "/api/queue-status"
          qs:
            userId: "{{ userId }}"
          expect:
            - statusCode: 200

      # 사용자 행동 대기
      - think: 10

      # 세션 종료
      - post:
          url: "/api/end-session"
          json:
            userId: "{{ userId }}"
            sessionId: "{{ sessionId }}"
          expect:
            - statusCode: [200, 204]